app/controllers/apply_jobs_controller.rb

SELECT "apply_jobs".* FROM "apply_jobs" WHERE "apply_jobs"."candidate_id" = ? LIMIT ?  [["candidate_id", 1], ["LIMIT", 1]]
---
  def index
    @apply_jobs = ApplyJob.where(candidate: @candidate)

SELECT "apply_jobs".* FROM "apply_jobs" WHERE "apply_jobs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."apply_job_id" = ? LIMIT ?  [["apply_job_id", 2], ["LIMIT", 1]]
---
  def show
    @apply_job = ApplyJob.find(id)
    @feedback = Feedback.find_by(apply_job: @apply_job)

INSERT INTO "apply_jobs" ("candidate_id", "job_opportunity_id", "message", "created_at", "updated_at", "feedback") VALUES (?, ?, ?, ?, ?, ?)  [["candidate_id", 2], ["job_opportunity_id", 2], ["message", "fdf"], ["created_at", "2020-05-18 14:05:16.910870"], ["updated_at", "2020-05-18 14:05:16.910870"], ["feedback", "Em espera"]]
---
  def create
    @apply_job = ApplyJob.new(require_params)
    @apply_job.candidate = @candidate
    @apply_job.job_opportunity = @job_opportunity

    if @apply_job.save

SELECT "apply_jobs".* FROM "apply_jobs" WHERE "apply_jobs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
     @apply_job = ApplyJob.find(id)

SELECT "apply_jobs".* FROM "apply_jobs" WHERE "apply_jobs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "apply_jobs" SET "message" = ?, "updated_at" = ? WHERE "apply_jobs"."id" = ?  [["message", "jjddfd"], ["updated_at", "2020-05-18 15:14:42.106581"], ["id", 2]]
---
  def update
    @apply_job = ApplyJob.find(id)

    if @apply_job.update(require_params)

SELECT "apply_jobs".* FROM "apply_jobs" WHERE "apply_jobs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "apply_jobs" WHERE "apply_jobs"."id" = ?  [["id", 2]]
---
  def destroy
    @apply_job = ApplyJob.find(id)
    @apply_job.destroy

SELECT "job_opportunities".* FROM "job_opportunities" WHERE "job_opportunities"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def find_job_opportunity
    @job_opportunity = JobOpportunity.find(params[:job_opportunity_id])

SELECT "candidates".* FROM "candidates" WHERE "candidates"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
---
  def find_candidate
    @candidate = Candidate.find_by(user: current_user)