app/controllers/awnser_proposals_controller.rb

  def find_candidate_and_proposal
    @candidate = Candidate.find(params[:candidate_id])
---
SELECT "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]