app/controllers/awnser_proposals_controller.rb

  def new
    @awnser_proposal = AwnserProposal.find_by(proposal: @proposal)

    if @awnser_proposal
      @choices = Choice.all
---
SELECT "awnser_proposals".* FROM "awnser_proposals" WHERE "awnser_proposals"."proposal_id" = ? LIMIT ?  [["proposal_id", 1], ["LIMIT", 1]]
SELECT "choices".* FROM "choices"

  def create
    @awnser_proposal = AwnserProposal.new(require_params)
    @awnser_proposal.proposal = @proposal

    if @awnser_proposal.save
---
INSERT INTO "awnser_proposals" ("choice_id", "proposal_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["choice_id", 2], ["proposal_id", 1], ["created_at", "2020-05-18 23:37:03.548699"], ["updated_at", "2020-05-18 23:37:03.548699"]]

  def update
    @awnser_proposal = AwnserProposal.find(id)
    if @awnser_proposal.update(require_params)
---
SELECT "proposals".* FROM "proposals" WHERE "proposals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "awnser_proposals".* FROM "awnser_proposals" WHERE "awnser_proposals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "proposals" SET "status" = ?, "updated_at" = ? WHERE "proposals"."id" = ?  [["status", "Aceito"], ["updated_at", "2020-05-18 23:56:51.850569"], ["id", 1]]
UPDATE "awnser_proposals" SET "choice_id" = ?, "updated_at" = ? WHERE "awnser_proposals"."id" = ?  [["choice_id", 1], ["updated_at", "2020-05-18 23:46:15.861198"], ["id", 1]]

  def find_candidate_and_proposal
    @candidate = Candidate.find(params[:candidate_id])
    @proposal = Proposal.find(params[:proposal_id])
---
SELECT "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "proposals".* FROM "proposals" WHERE "proposals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]