app/controllers/candidates_controller.rb

SELECT "job_opportunities".* FROM "job_opportunities" WHERE "job_opportunities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "apply_jobs".* FROM "apply_jobs" WHERE "apply_jobs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def profile_as
    @job_opportunity = JobOpportunity.find(params[:job_opportunity_id])
    @apply_job = ApplyJob.find(params[:apply_job_id])

SELECT "comments".* FROM "comments"
SELECT "comments".* FROM "comments" WHERE "comments"."headhunter_id" = ?  [["headhunter_id", 2]]
---
  def show
    if user_signed_in?
      @candidate = find_candidate
      @comments = Comment.all
    end

    if headhunter_signed_in?
      @candidate = find_candidate_by_route
      @comments = Comment.where(headhunter: current_headhunter)

SELECT "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_candidate_by_route
    Candidate.find(id)

SELECT "candidates".* FROM "candidates" WHERE "candidates"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
  def find_candidate
    Candidate.find_by(user: current_user)