app/controllers/candidates_controller.rb

	def show

		if user_signed_in?
	    		@candidate = Candidate.find_by(user: current_user)
			@comments = Comment.all
		end

		if headhunter_signed_in?
			@candidate = Candidate.find(id)
---
SELECT "candidates".* FROM "candidates" WHERE "candidates"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]