app/controllers/candidates_controller.rb

SELECT "candidates".* FROM "candidates"
---
	def index
		@candidates = Candidate.all

SELECT "candidates".* FROM "candidates" WHERE "candidates"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT "candidates".* FROM "candidates" WHERE (2) LIMIT ?  [["LIMIT", 1]]
---
	def show
		if user_signed_in?
	    		@candidate = Candidate.find_by(user: current_user)
		end

		if headhunter_signed_in?
			@candidate = Candidate.find_by(id)

SELECT "candidates".* FROM "candidates" WHERE "candidates"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "levels".* FROM "levels"
---
	def new
		@profile = Candidate.find_by(user: current_user)

		if @profile
			redirect_to job_opportunities_path
		else
			@candidate = Candidate.new
			@levels = Level.all

INSERT INTO "candidates" ("full_name", "social_name", "profile_description", "experience", "user_id", "created_at", "updated_at", "formation", "courses", "level_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "levels".* FROM "levels"
---
	def create

		@candidate = Candidate.new(require_params)
		@candidate.user = current_user

		if @candidate.save
			flash[:notice] = 'Perfil criado com sucesso'
		    	redirect_to job_opportunities_path
		else
			@levels = Level.all

SELECT "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "levels".* FROM "levels"
---
	def edit
		@candidate = Candidate.find(id)
		@levels = Level.all

SELECT "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "candidates" SET "updated_at" = ? WHERE "candidates"."id" = ?  [["updated_at", "2020-05-16 21:35:43.537979"], ["id", 1]]
---
	def update
		@candidate = Candidate.find(id)
		if @candidate.update(require_params)

SELECT "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "candidates" WHERE "candidates"."id" = ?  [["id", 1]]
---
	def destroy
		@candidate = Candidate.find(id)
		@candidate.destroy