app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @comment = Comment.find(id)

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "Ola, gostei do seu perfil, podemos marcar uma entrevista?"], ["updated_at", "2020-05-18 17:40:09.359668"], ["id", 1]]
SELECT "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
    @comment = Comment.find(id)

    if @comment.update(require_params)
      redirect_to candidate_path(@candidate)
      flash[:notice] = 'Comentário atualizada com sucesso'
    else
      @candidate = Candidate.find(params[:candidate_id])

SELECT "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_candidate
    @candidate = Candidate.find(params[:candidate_id])