app/controllers/feedbacks_controller.rb

  def new
    @feedback = Feedback.find_by(apply_job: @apply_job)
    @choices = Choice.all
---
SELECT "choices".* FROM "choices"

  def create
    @feedback = Feedback.new(require_params)
    @feedback.apply_job = @apply_job

    if @feedback.save
---
INSERT INTO "feedbacks" ("message", "apply_job_id", "created_at", "updated_at", "choice_id") VALUES (?, ?, ?, ?, ?)  [["message", "fdfd"], ["apply_job_id", 2], ["created_at", "2020-05-18 19:11:31.838545"], ["updated_at", "2020-05-18 19:11:31.838545"], ["choice_id", 1]]

  def find_apply_and_job
    @job_opportunuty = JobOpportunity.find(params[:job_opportunity_id])
    @apply_job = ApplyJob.find(params[:apply_job_id])
---
SELECT "job_opportunities".* FROM "job_opportunities" WHERE "job_opportunities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "apply_jobs".* FROM "apply_jobs" WHERE "apply_jobs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]