app/controllers/job_opportunities_controller.rb

	def index
		if headhunter_signed_in?
			@jobs = JobOpportunity.where(headhunter: current_headhunter)
		else
			@jobs = JobOpportunity.all
---
SELECT "job_opportunities".* FROM "job_opportunities" WHERE "job_opportunities"."headhunter_id" = ?  [["headhunter_id", nil]]
SELECT "job_opportunities".* FROM "job_opportunities"

	def show
	    	@job = JobOpportunity.find(id)
		@proposals = Proposal.where(job_opportunity: @job)
		@awnser_proposals = AwnserProposal.where(proposal: @proposals)
		@applyjob = ApplyJob.where(job_opportunity: @job)

		if user_signed_in?
			@candidate = Candidate.find_by(user: current_user)
			@apply_jobs = ApplyJob.where(candidate: @candidate, job_opportunity: @job)
---
SELECT "job_opportunities".* FROM "job_opportunities" WHERE "job_opportunities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "awnser_proposals".* FROM "awnser_proposals" WHERE "awnser_proposals"."proposal_id" IN (SELECT "proposals"."id" FROM "proposals" WHERE "proposals"."job_opportunity_id" = ?)  [["job_opportunity_id", 1]]
SELECT "apply_jobs".* FROM "apply_jobs" WHERE "apply_jobs"."job_opportunity_id" = ? LIMIT ?  [["job_opportunity_id", 2], ["LIMIT", 1]]
SELECT "candidates".* FROM "candidates" WHERE "candidates"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def new
		@job = JobOpportunity.new
		@levels = Level.all
---
SELECT "levels".* FROM "levels"

	def create
		@job = JobOpportunity.new(require_params)
		@job.headhunter = current_headhunter

            	if @job.save
			flash[:notice] = 'Vaga criada com sucesso'
	    		redirect_to @job
	    	else
			@levels = Level.all
---
INSERT INTO "job_opportunities" ("title", "company", "description_job", "skills", "salary_range", "level_id", "deadline", "region", "benefits", "office_functions", "company_expectations", "created_at", "updated_at", "headhunter_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "levels".* FROM "levels"

	def edit
		@job = JobOpportunity.find(id)
		@levels = Level.all
---
SELECT "job_opportunities".* FROM "job_opportunities" WHERE "job_opportunities"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "levels".* FROM "levels"

	def update
		@job = JobOpportunity.find(id)
---
SELECT "job_opportunities".* FROM "job_opportunities" WHERE "job_opportunities"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

	def destroy
		@job = JobOpportunity.find(id)
		@job.destroy
---
SELECT "job_opportunities".* FROM "job_opportunities" WHERE "job_opportunities"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "job_opportunities" WHERE "job_opportunities"."id" = ?  [["id", 2]]