app/controllers/proposals_controller.rb

	def index
		@proposals = Proposal.where(candidate: @candidate)
---
SELECT "proposals".* FROM "proposals" WHERE "proposals"."candidate_id" = ?  [["candidate_id", 1]]

	def new
		@proposals = Proposal.find_by(candidate: @candidate)

		if @proposals
			flash[:alert] = 'Uma proposta para esta vaga já foi enviada'
			redirect_to candidate_path(@candidate)
		else
			@proposal = Proposal.new
			@jobs = JobOpportunity.where(headhunter: current_headhunter)
---
SELECT "proposals".* FROM "proposals" WHERE "proposals"."candidate_id" = ? LIMIT ?  [["candidate_id", 2], ["LIMIT", 1]]
SELECT "job_opportunities".* FROM "job_opportunities" WHERE "job_opportunities"."headhunter_id" = ?  [["headhunter_id", 2]]

	def create
		@proposal = Proposal.new(require_params)
		@proposal.candidate = @candidate

		if @proposal.save
---
INSERT INTO "proposals" ("message", "job_opportunity_id", "candidate_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["message", ""], ["job_opportunity_id", 2], ["candidate_id", 2], ["created_at", "2020-05-18 23:09:16.457276"], ["updated_at", "2020-05-18 23:09:16.457276"]]

	def find_candidate
		@candidate = Candidate.find(params[:candidate_id])
---
SELECT "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]