app/views/layouts/application.html.erb

SELECT "candidates".* FROM "candidates" WHERE "candidates"."user_id" = ? LIMIT ?  [["user_id", 4], ["LIMIT", 1]]
---
		<% if user_signed_in? %>
			<% candidate = Candidate.find_by(user: current_user)%>